<template>
	<div>
		<ds-nav :pagename="pagename"></ds-nav>
		<div class="page-wrapper">
			<div class="page-info uk-visible@s">
				<h1 class="page-name"> {{ pagename }} </h1>
				<div class="page-name-border" style="width: 100px;"></div>	
			</div>
			<div class="spacing"></div>
			<div uk-grid>
				<div class="uk-width-small@m">
			        <ul class="side-list uk-nav uk-nav-default" uk-switcher="connect: #component-nav; animation: uk-animation-fade; toggle: > :not(.uk-nav-header)">
			            <li id="about-toggle" @click="setPagename('عن الخدمة')"><a href="#">عن الخدمة</a></li>
						<li id="terms-toggle" @click="setPagename('شروط الاستخدام')"><a href="#">شروط الاستخدام</a></li>
						<li id="disclaimer-toggle" @click="setPagename('إخلاء مسؤولية')"><a href="#">إخلاء مسؤولية</a></li>
						<li id="policy-toggle" @click="setPagename('سياسة البيانات')"><a href="#">سياسة البيانات</a></li>
			        </ul>
			    </div>
			    <div class="uk-width-expand@m">
			        <ul id="component-nav" class="uk-switcher">
			            <li id="about-section">
			            	<div>
					    		<p>هذه الخدمة مُقدَّمة بغرض تيسير التّعاون بين النّاس بتسهيل إيجاد الأدوية غير المتوافرة في محيط بعضهم أو هي أغلى من قدرتهم الماديّة بطريق التّوصيل ما بين من لديهم فائض من أدوية يرغبون في التّبرُّع بها و&nbsp;من يطلبون تلك الأدوية.</p>
								<p>هذه الخدمة مجّانية لا يُدفع مقابل عينيّ و&nbsp;لا مادّي لاستخدامها، و&nbsp;لا تقدِّم مشورة صيدليّة، و&nbsp;لا يُقصد بها الاتّجار في الأدوية. و استخدامها يُعدُّ موافقة ضمنيّة على <a @click.stop="showTerms()">شروط الخدمة</a>.</p>
								<p>لعرض دواء زائد عن حاجتك ينبغي ألّا تقلّ المدّة الباقية على انتهاء صلاحيّته عن المدّة المبيّنة في استمارة الإدخال، كما تنبغي مراعاة الدّقة عند إدخال بيانات الدّواء.</p>
								<p>
								تُحذف إدراجات الأدوية تلقائيا بانتهاء صلاحيّتها أو بطلب المستخدم الذي أدرجها.
								</p>
								<p>هذا النّظام لا يستعمل كلمات السّر! هذا آمَن و يعفيك من عناء تذكُّر كلمة سرّ أخرى. كلّ المعاملات تجري بطريق رسائل البريد الإلكتروني، فتنبغي مراعاة الدّقّة في إدخال عنوان البريد. النّظام لا يحفظ أيّة بيانات عن المستخدمين واضعي الإدراجات غير ما هو مبيّن في <a
								@click.stop="showPolicy()">سياسة البيانات</a>، و&nbsp;لا يحفظ أيّة بيانات عن الطّالبين.</p>
								<p>
									طالبو الأدوية مسؤولون عن التّحقّق من صلاحيتها و&nbsp;ملاءمتها لاحتياجاتهم، و&nbsp;عن أيّ تعامل بينهم و&nbsp;المانحين كما هو موضّح في <a @click.stop="showDisclaimer()">بيان إخلاء المسؤولية</a>.
								</p>
								<p>هذه الخدمة أنشئت و&nbsp;تُشغّل بتبرّعات من أفراد مصريين كُرماء.</p>
								<p>الاسم من ابتكار لميا :)</p>
					    	</div>
			            </li>
			            <li id="terms-section">
			            	<div>
					    		<p>بمواصلة استخدامك هذه الخدمة و&nbsp;مطالعة المنشور عبرها فإن ذلك يعد إقرارًا ضمنيا منك بقبول الشروط التالية:</p>
								<ul class="bulky-list">
									<li>إقرارك بأنّ استخدامك الخدمة فعلك بإرادتك و&nbsp;باختيارك</li>
									<li>قبول وصفك "مستخدمًا" للخدمة على النحو الذي يرد في هذه الشروط و&nbsp;في <a @click.stop="showDisclaimer()">بيان إخلاء المسؤولية</a> و&nbsp;في<a @click.stop="showPolicy()"> سياسة البيانات</a></li>
									<li>قبولك كُلِّ المسؤولية عن كلّ تصرّفاتك عبرها و&nbsp;قبول إخلاء مسؤولية الخدمة كما هو مذكور في <a @click.stop="showDisclaimer()">بيان إخلاء المسؤولية</a></li>
									<li>امتناعك عن أي فعل بطريق الخدمة يكون فيه أي ضرر لأي شخص أو مخالفة القانون</li>
									<li>امتناعك عن كل ما من شأنه تعطيل الخدمة أو منعها عن آخرين، أو استخدامها على نحو غير الذي ترشدك إليه الخدمة</li>
									<li>التزامك بإدخال بيانات و&nbsp;معلومات صحيحة حيثما يُطلب إدخال بيانات و&nbsp;معلومات</li>
									<li>قبولك كلّ المسؤولية عما يترتب على إتاحة نفاذ الكافة إلى البيانات و&nbsp;المعلومات التي تدخلها</li>
								</ul>
					    	</div>
			            </li>
			            <li id="disclaimer-section">
			            	<div>
					    		<p>فيما يلي يُقصد بكلمة "الخدمة" كل الوظائف و&nbsp;الصيرورات المتاحة للكافة و&nbsp;المعلومات المنشورة على الإنترنت من خلال اسم النطاق dawasawa.online و&nbsp;مديروها و&nbsp;مشغّلوها و&nbsp;كلّ شخص طبيعي أو اعتباري له علاقة مباشرة أو غير مباشرة بكلّ ما يتعلّق بما سبق.</p>

								<p>و يُقصد بكلمة "أدوية" كل المواد و&nbsp;المركبّات و&nbsp;العقاقير و&nbsp;الأمصال و&nbsp;اللقاحات و&nbsp;الوصفات، الطبيعي منها و&nbsp;المُخلّق، أيا كانت هيئته أو أسلوب استعماله، التي لها أو يُظنّ بأنّ لها أثرًا طبيا أو صيدلانيًا على الصحة الجسدية أو النفسية.</p>

								<p>هذه الخدمة مقدَّمة بغرض تيسير التعاون بين الناس بتسهيل إيجاد الأدوية غير المتوافرة في محيط بعضهم أو هي أغلى من قدرتهم المادية بطريق التوصيل ما بين من لديهم فائض من أدوية يرغبون في التبرّع بها و&nbsp;من هم بحاجة إليها. و&nbsp;هي خدمة مجّانية لا يُدفع مقابل عيني و&nbsp;لا مادّي لاستخدامها.</p>
								<p>هذه الخدمة لا تُقدّم المشورةَ الطبية و&nbsp;لا الصيدلانية و&nbsp;لا التّشخيص و&nbsp;لا تصفُ أدوية و&nbsp;لا إجراءات علاجية لأيّ شخص، و&nbsp;لا تقدِّم بتًاتًا بأيّ وسيلة، لا عبر الإنترنت و&nbsp;لا عبر غيرها، رأيًا و&nbsp;لا نصيحة في فوائد و&nbsp;أضرار أيّة أدوية أو عقاقير على الإطلاق، سواء كانت معروضة من خلال الخدمة أو غير ذلك، و&nbsp;ليست لها أي علاقة بأيّ جهات طبّية أو صيدلية.</p>
								<p>و الخدمة غير مسؤولة عن طبيعة الأدوية التي يودعها المستخدمون العارضون فيها، و&nbsp;لا تضمن ملائمة أي مادة لأي غرض طبي أو صيدلاني أو علاجي أو وقائي أو غذائي أو غير ذلك، و&nbsp;لا علم لديها بأيٍّ من ذلك.</p>
								<p>يقتصر ما تقدّمه الخدمة على حفظ و&nbsp;عرض بيانات الأدوية المعروضة للتبرُّع بها و&nbsp;وسيلة الاتّصال التي أدخلها المُستخدِم العارض، و&nbsp;تشغيل صيرورة إدارة تلك البيانات على النّحو المذكور في <a @click.stop="showPolicy()">سياسة البيانات</a>، و&nbsp;تيسير البحث فيما قد يكون مُدرجا في سجلّاتها من أدوية بالاسم الذي يحدّده المستخدم الباحث لدواء يعرفه مسبقا و&nbsp;يطلبه. فهي لا تُتيح لمستخدميها وسيلة لاستعراض مُجمَل ما يُدخل فيها من بيانات.</p>
								<p>و الخدمة غير مسؤولة عن فحوى أيّة بيانات أو معلومات يودعها أي شخص فيها، سواء كانت تلك البيانات و&nbsp;المعلومات صحيحة أو غير ذلك، فلا تضمن الخدمة صحّة أية بيانات أو معلومات، و&nbsp;لا تقبل أيّ مسؤولية قانونية عن تداول أو نشر أية بيانات أو معلومات عبرها، و&nbsp;لا أي مسؤولية عن أيّ ضرر مادي أو معنوي قد يقع على أي شخص نتيجة حفظ و&nbsp;عرض تلك البيانات و&nbsp;المعلومات للكافة، و&nbsp;لا تقبل أي مسؤولية عن أي مخالفة قانونية تنتج عن تصرّف يأتي به أي شخص عبرها، أيّا كان غرضه من ذلك التّصرُّف. من البيانات المقصودة هنا على سبيل المثال لا الحصر: أسماء الأدوية، و&nbsp;تواريخ انتهاء صلاحياتها، و&nbsp;بيانات الاتّصال بالأشخاص.</p>
								<p>كما أن هذه الخدمة لا تتوسط بين العارضين و&nbsp;الطالبين من المستخدمين و&nbsp;لا تنقُل أيّة رسائل بين أي أطراف و&nbsp;لا تضمّ وسائل للتواصل بين الأشخاص، لا عبر الإنترنت و&nbsp;لا عبر غيرها. و&nbsp;الخدمة ليست طرفا في أيّ تعامل يجري في أي وقت بين أي ممن يستخدمونها أو من كانوا قد استخدموها في أي وقت سابق، و&nbsp;لا تُعدُّ مسؤولة عن أي ضرر مادّيّ أو معنويّ قد يقع في أيّ وقت على من يستخدمها أو على من ييسِّر لغيره استخدامها على أيّ نحو أو على من يُسِّرَ له استخدامها، و&nbsp;سواء وقع الضّرر على المستخدم نفسه أو على غيره من أشخاص يكون المستخدم مسؤولا عنهم مسؤولية قانونية أو تربطه بهم علاقة تعاقدية أو أي علاقة يُقدِّم فيها المستخدم لمن وقع عليه الضّرر أيّ خدمة من أيّ نوع، صحية أو طبية أو غير ذلك.</p>
								<p>و الخدمة مقدّمة على حالها بلا أية ضمانات، بما في ذلك ضمان اشتغالها على نحو بعينه، و&nbsp;ضمان تحقّق أي فائدة أو نفع لمستخدميها نتيجة استخدامها.</p>
					    	</div>
			            </li>
			            <li id="policy-section">
			            	<div>
					    		<p>لأجل تحقيق الغرض منها فإن هذه الخدمة توظّف تقنيات معلوماتية متنوّعة لمعالجة و&nbsp;حفظ البيانات التي يدخلها مستخدموها، بما في ذلك بيانات يُدخلها المستخدمون بأنفسهم و&nbsp;بيانات تتولّد نتيجة اشتغال النظّم العديدة التي تتكوّن منها الخدمة.</p>
								<p>فعند إيداع المستخدم استمارة طلب إدراج مُدخلة تَحفظُ الخدمة كلَّ البيانات المُدخلة في الاستمارة، كما يُحفظُ تاريخ إيداع طلب الإدراج. و&nbsp;فيما عدا البيانات المدخلة في الاستمارة لا تحفظ الخدمة أية بيانات أخرى مستنبطة من اتّصال المستخدم بالخدمة عبر الإنترنت، لا عنوان الإنترنت المتّصل منه، و&nbsp;لا معلومات جغرافية، و&nbsp;لا مُعرّفات مميزة لعتاد أو برمجيات المستخدم، و&nbsp;لا بيانات يمكن منها تمييز المستخدم كفرد فيما عدا ما يدخله بنفسه في الاستمارة.</p>
								<p>تُحذف المدخلات من سجلّ المدخلات الجارية لأحد الأسباب التالية:</p>
								<ul>
									<li>انقضاء المهلة المحددة لإتمام إجراء توكيد طلب الإدراج التي يُعرّف بها المستخدم عند إيداعه الطلب</li>
									<li>انقضاء مدة صلاحية الدواء المُدخلة</li>
									<li>بطلب المستخدم الذي أدخلها</li>
								</ul>
								<div style="height: 12px;"></div>
								<p>بعد حذف مُدخلة من سجّل المدخلات الجارية تُمحى بعض بياناتها و&nbsp;يُنقل بعضها الآخر في صيغته الأصلية أو صيغة مشتقة منها إلى الأرشيف. البيانات التي تُحفظ في الأرشيف هي:</p>
								<ul>
									<li>اسم الدواء</li>
									<li>المحافظة</li>
									<li>تلبيدة عنوان البريد الإلكتروني</li>
									<li>تلبيدة رقم التلفون إذا أدخِل</li>
									<li>سبب و&nbsp;تاريخ الحذف من سجّل المدخلات الجارية.</li>
								</ul>
								<p>التلبيدة قطعة معلوماتية مستنبطة مِنْ دخل ما بحيث تكون فريدة لكل دخل مختلف و&nbsp;متطابقة لكل الدخل المتطابق، و&nbsp;هي خرج تطبيق دالة غير عكوسة على الدَّخل. أي أنّه لا يمكن استنباط الدخل من الخرج.</p>
								<p>لا يلزم لاستخدام الخدمة فتح حسابات و&nbsp;لا الولوج إليها لذا لا تحفظ أسماء مستخدمين و&nbsp;لا كلمات سرّ أو ماشابهها.</p>
								<p>عناوين البريد المدخلة أثناء الاستخدام لا تُحفظ إلا للمدة اللازمة للإجراء المطلوب و&nbsp;لا تُتاح لأية أطراف خارجية.</p>
					    	</div>
			            </li>
			        </ul>
			    </div>
			</div>
		</div>
		
	</div>
</template>

<script>
	import Navbar from '../components/nav_bar.vue';
	import Alert from '../components/alert.vue';

	const navigation = require('../data/navigation.json');

	export default {
		data() {
			return {
				pagename: "عن الخدمة"
			}
		},
		components: {
			'ds-nav': Navbar,
			'ds-alert': Alert
		},
		methods: {
			setPagename(name) {
				this.pagename = name
			},
			showPolicy() {
				// remove visibility classes from all elements
				$('.side-list li').attr("aria-expanded", function() {
					return false
				}).removeClass('uk-active')
				$('#component-nav li').removeClass('uk-active')
				// add visibility classes to the required elements
				$('#policy-toggle').attr("aria-expanded", function() {
					return true
				}).addClass('uk-active')
				$('#policy-section').addClass('uk-active')
			},
			showTerms() {
				// remove visibility classes from all elements
				$('.side-list li').attr("aria-expanded", function() {
					return false
				}).removeClass('uk-active')
				$('#component-nav li').removeClass('uk-active')
				// add visibility classes to the required elements
				$('#terms-toggle').attr("aria-expanded", function() {
					return true
				}).addClass('uk-active')
				$('#terms-section').addClass('uk-active')
			},
			showDisclaimer() {
				// remove visibility classes from all elements
				$('.side-list li').attr("aria-expanded", function() {
					return false
				}).removeClass('uk-active')
				$('#component-nav li').removeClass('uk-active')
				// add visibility classes to the required elements
				$('#disclaimer-toggle').attr("aria-expanded", function() {
					return true
				}).addClass('uk-active')
				$('#disclaimer-section').addClass('uk-active')
			}
		}
	}
</script>

<style>
	.uk-nav-default>li.uk-active>a {
		color: #e84c3d;
	}
	.spacing {
		height: 30px;
	}
	#component-nav p {
		font-size: 1.3rem;
		font-family: 'Scheherazade', serif !important;
		text-align: justify;
		max-width: 1200px;
	}
	#component-nav li {
		font-size: 1.1rem;
		font-family: 'Scheherazade', serif !important;
	}
	@media screen and (max-width: 640px) {
		.spacing {
			height: 0;
		}
		#component-nav p {
			font-size: 1rem;
			line-height: 1.8;
			word-spacing: 0.2rem;
		}
	}
</style>
